# English (Generic)
# jExiftoolGUI v1.5

exifhelptitle = Hilfe f\u00fcr das EXIT-Editierpanel
xmphelptitle = Hilfe f\u00fcr das XMP-Editierpanel
exifandxmphelp = <big>EXIF- oder XMP-Metadaten</big><hr><br>Hier lassen sich EXIF- oder XMP-Metadaten f\u00fcr ausgew\u00e4hlte Bilder hinzuf\u00fcgen.</p>\
<p><b>Bitte beachten:</b></p><p>Viele Aktionen lassen sich \u00fcber "Checkboxen" neben den Eingabefeldern steuern. \
Nur wenn diese Checkboxen aktiviert sind, werden die Felder (auch leere) gespeichert. Das bedeutet:\
<ul><li>Felder k\u00f6nnen versehentlich mit leeren Eintr\u00e4gen \u00fcberschrieben</li><li>oder gle\u00f6scht werden.</li></ul>\
<h3>Verf\u00fcgbare Buttons:</h3>\
<ul><li><b>Kopieren</b>: Die kopiert alle vorhandenen XMP-Datenfeldern aus den ausgew\u00e4hlten Bildern.</li>\
<li><b>Speichern</b>: Dies speichert die "aktivierten" Datenfelder in die ausgew\u00e4hlten Bilder.</li>\
<li><b>Voreinstellungen kopieren</b>: Dies kopiert die in den Einstellungen angegebenen Angaben f\u00fcr den Autor und die Rechte.</li>\
<li><b>Zur\u00fccksetzen</b>: Dies setzt die Felder auf die Voreinstellungen zur\u00fcck.</li>\
<li><b>Hilfe</b>: Zeigt diesen Hilfstext.</li></ul>


geotagginghelptitle = Hilfe f\u00fcr das Geotaggingpanel
geotagginghelp = <big>Geotagging</big><hr><br>Geotagging f\u00fcgt GPS-(Positions-)Daten zu Bildern aus GPS Track Dateien hinzu.\
GPS Track k\u00f6nnen vom Handy, Navi oder sonstwie stammen.<br>\
 Die Positionsdaten der Bilder werden anhand der Zeitmarken in den Bildern und den (linear interpolierten) Positionen im Track ermittelt \
und als Metadaten in die Bilder geschrieben. Voraussetzung f\u00fcr korrekte Positionsdaten ist die richtige Uhrzeit der Kamera.<br><br>\
jExifToolGUI unterst\u00fctzt das "Geosync" Feature des ExifTools, mit dem sich die Uhrzeiten synchronisieren lassen.<br>\
Ein Beispiel: Eine Angabe von "+1:20" bedeutet, dass zu den Zeitmarken in den Bildern 1 Minute und 20 Sekunden addiert werden, bevor die Positionsdaten im GPS Track bestimmt werden. Das ist erforderlich, wenn die Kamerauhrzeit hinter der GPS Zeit liegt.<br>\
Geosync Angaben werden in der Form  "ss", "mm:ss", "SS:mm:ss" oder "TT SS:mm:ss" (ss=Sekunden, mm=Minuten, SS=Stunden und TT=Tage), \
und einem Vorzeichen "+" oder "-" angegeben.<br><b>Hinweis:</b> Doppelte Hochkommata sollen dabei nicht verwendet werden jExifToolGUI, nur die Ziffern: -25 oder +1:20<br><br>\
jExifToolGUI bietet zwei Optionen:\
<ol><li>Bilder k\u00f6nnen links manuell ausgew\u00e4hlt werden.</li><li>Ein Verzeichnis mit Bildern kann ausgew\u00e4hlt werden.</li></ol></p>\
<p>Im ersten Fall bleibt das Bilderverzeichnis leer. Wird ein Bilderverzeichnis angegeben, werden immer alle darin enthaltenen Bilder bearbeitet.<br><br>\
Die Checkbox "Originale \u00fcberschreiben<" (voreingestellt aktiv) erzeugt keine Backup Dateien sondern \u00fcberschreibt die Originalbilder. Deaktiviert speichert das ExifTool die Originalbilder mit der zus\u00e4tzlichen Extemsion ".original"<br><br>\
jExifToolGUI schreibt sowohl EXIF GPS Tags als auch gleichzeitig XMP GPS Tags.


gpshelptitle = Hilfe f\u00fcr das GPS-Lokalisierungspanel
gpshelp = <big>GPS Lokalisierungen</big><hr><br>Hier werden GPS-Daten zu den Bildern hinzugef\u00fcgt. Das geschieht in Kombination von EXIF-, XMP und \
IPTC GPS Daten wie Breitengrad, L\u00e4ngengrad und H\u00f6he, die sowohl in die  EXIF- als auch die XMP-Metadatenstruktur kopiert werden.<br><br>\
Weitere Details wie Land, (Bundes-)Staat, Stadt, Ort usw. k\u00f6nnen als XMP und/oder IPTC Tags angegeben werden.<br><br>Die Funktionen wirken also \
gleichzeitg auf mehrere Kategorien von Metadaten (EXIF, XMP und IPTC), um die Angaben m\u00f6glichst vollst\u00e4ndig zu setzen.


yourcommandstitle = Hilfe f\u00fcr "Eigene Befehlszeilen"
yourcommands = <big>Eigene Befehlszeilen</big><hr><br>Hier lassen sich eigne Befehlszeilen f\u00fcr das ExifTool definieren. Die Parameter werden um die Liste der ausgew\u00e4hlten Bilder erg\u00e4nzt.\
<br>Es lassen sich sowohl Befehlszeilen zum Lesen als auch zum Schreiben von Informationen definieren, allerdings nicht in einer Befehlszeile; Schreibbefehle haben dann Vorrang. Mehrere Parameter lassen sich in einer Befehlszeile kombinieren. \
<b>Note:</b> Der Befehl exiftool soll nicht in der Befehlszeile angegeben werden, das wird automatisch erg\u00e4nzt.<br>\
Allerdings muss der Anweder f\u00fcr korrekte einfache und doppelte Hochkommata in den Befehlszeilen Sorge tragen. \
Um beispielsweise das Datum auf den Aufnahmezeitpunkt zu setzen wird<tt>-FileModifyDate&lt;DateTimeOriginal</tt> angegeben.\
Unter Windows sind doppelte, bei Linux und MacOS einfache Hochkommata erforderlich:\
<ul><li>Linux/MacOS: <tt>'-FileModifyDate&lt;DateTimeOriginal'</tt></li><li>Windows: <tt>"-FileModifyDate&lt;DateTimeOriginal"</tt></li></ul>\
Weitere Beispiele::<table border="1" cellpadding="10">\
<tr><td>-exif:all</td><td>zeigt alle Tags der ausgew\u00e4hlten Bilder an</td></tr>\
<tr><td>-exif:all=</td><td>entfernt(<b>!</b>) alle Tags der ausgew\u00e4hlten Bilder</td></tr>\
<tr><td>-Exif:Artist="Name"</td><td> schreibt "Name" in die ausgew\u00e4hlten Bilder</td></tr>\
<tr><td>-Xmp:City=Zwolle -Xmp:Country=Netherlands</td><td>schreibt Ort und Land in die XMP-Tags  der ausgew\u00e4hlten Bilder</td></tr></table>\
Siehe auch <a href="https://www.exiftool.org/exiftool_pod.html" target="_blank">exiftool Application Documentation</a> f\u00fcr weitere Informationen.


copymetadatatitle = Hilfe f\u00fcr "Kopiere Metadaten"
copymetadatatext = <big>Kopiere Metadaten</big><hr><br>Diese Funktionen kopieren Metadaten von einem Bild in andere, ausgew\u00e4hlte Bilder.<br><br>\
Das kann auf mehrere Arten erfolgen:<ul>\
<li>Alle Information werden in die gleichnamigen Tags (in den vorgesehenen Gruppen) kopiert</li>\
<li>Alle Information aller Gruppen werden in die gleichen Gruppen kopiert</li>\
<li>ausgew\u00e4hlte Gruppen werden kopiert</li></ul><br>\
Das ist NICHT identisch mit dem "Umkopieren" von XMP-Tags, wie dies "Extra -> Metadaten nach XMP kopieren" macht.<br><br>


gpanohelptitle = Hilfe f\u00fcr das Gpanopanel
gpanohelp = <big>Gpano</big><hr><br>Wird f\u00fcr Googles PhotoSphere GPano Daten verwendet.<br><br>\
Googles PhotoSphere wurde 2012 aktiviert, um automatische Panoramabilder zu erzeugen.\
 F\u00fcr weitere Informationen siehe: https://developers.google.com/streetview/spherical-metadata<br><br>\
Mit einem Sternchen markierte Felder sind zwingend erforderlich. "Panorama Viewer verwenden" ist ebenfalls zwingend.


renamingtitle = Umbenennen
renamingtext = <big>Umbenennen</big><hr><br>Die Funktionen f\u00fcr Datum/Uhrzeit sind selbsterkl\u00e4rend.<br><br>\
<b>String:</b> Die kann eine beliebige Zeichenkette (mit Leerzeichen) sein. Als Kodierung wird UTF-8 verwendet. Allerdings k\u00f6nnen spezielle Zeichen unter unterschiedlichen Betriebssystemen Probleme bereiten...<br><br>\
<b>Kameramodel:</b> Bestimmt das Kameramodel f\u00fcr die ausgew\u00e4hlten Bilder.<br><br>\
<b>Location:</b> Extrahiert "xmp:location" Informationen der Bilder. Das funktioniert nur, wenn diese Informationen vorhandenen sind, weil sie beispielsweise zuvor  \
unter "Metadaten bearbeiten -> GPS" hinzugef\u00fcgt wurden.<br><br>\
<b>City Name:</b> Extrahiert "xmp:city".  Das funktioniert nur, wenn diese Informationen vorhandenen sind, weil sie beispielsweise zuvor \
unter "Metadaten bearbeiten -> GPS" hinzugef\u00fcgt wurden.<br><br>\
<b>ISO Wert:</b> Extrahiert "exif:iso". Falls die nur ein numerischer Wert ist (etwa: 100), wird die Zeichenkette "ISO" erg\u00e4nzt: 100ISO.<br><br>\
<b>Brennweite, umgerechnet auf 35 mm:</b> Brennweite, ber\u00fccksichtigt den Crop-Faktor.<br><br>\
<b>Original Dateiname:</b> Wie ihn die Kamera vergibt.<br>


lenshelptitle = Hilfe f\u00fcr das Objektivpanel
lenshelptext = <big>Objektive</big><hr><br>Hier gibt es zwei M\u00f6glichkeiten:<br>\
<ul><li>Objetivdaten lassen sich zu den ausgew\u00e4hlten Bildern hinzuf\u00fcgen (Buttons der ersten Reihe)</li>\
<li>Konfigurationsdateien f\u00fcr Objektive k\u00f6nnen erstellt oder bearbeitet werde (Buttons der unteren Reihe).</li></ul>\
Beide M\u00f6glichkeiten dienen zum Komplettieren der Objektivdaten.<br><br>\
Weiteres: Einige Spezialobjektive werden von den Kameras nicht vollst\u00e4ndig erkannt und daher deren Metadaten nicht in die Bilder augenommem. \
Hier lassen sich entsprechende Objektivkonfigurationen erstellen, um die Bilder um die fehlenden Metadaten zu erg\u00e4nzen.


exiftooldbtitle = Hilfe f\u00fcr das Exiftool Datenbank Query Panel
exiftooldbhelptext = <big>Exiftool Datenbankabfragen</big><hr><br>\
Exiftool unterst\u00fctzt Tags in einer Vielzahl von Familie (g0, g1, g2, g3, g4) und Gruppen (wie EXIF, XMP, IPTC, etc.). Diese Tags kann das Exiftool selbst auflisten, \
aber es ist schwierig, festzustelle, welche Tags in welche Gruppe geh\u00f6ren. Einige Tags treten mehrfach, etwa in den  Makernotes oder anderen, Kamera-spezifischen Gruppen auf. \
Verschiedene Tags k\u00f6nnen auch nahezu Gleiches beschreiben.<br><br>\
Warum gibt es diese Datenbank?: Weil sie schnell ist! Und sich eignet, um spezielle "Eigene Einstellungen", wie beispielsweise (Konfiurationen f\u00fcr Objektive) und anderes (ToDo) zu speichern.<br><br>\
(Hinweis: Die hier verwendete Datenbank ist nicht notwendigerweise identisch mit der im Hintergrund verwendeten Exiftool-Version.)<br><br>\
Die Abfrage erfolgt in drei Schritten:<br>\
<ol><li>1. Zeile: Zwei Auswahlm\u00f6glichkeiten (dropdowns) der Tags: "Nach Gruppen sortiert" und "Nach Kamera sortiert".  (Schalter vor den Men\u00fcs schalten dies um.).<br>\
(Die zweite Option ist eine Untermenge der ersten \u2013 mit aktuell ca. 320 Optionen \u2013, und dient der Vereinfachung f\u00fcr eine spezielle Kamera.) .</li>\
<li>2. Zeile: Dies erlaubt eine Mustersuche nach Tags. "width" findet beispielsweise alle Tags, in deren Namen "width" auftritt (das sind viele).</li>\
<li>3. Zeile: Hier Standard-SQL Queries in der Form "select taggroup,tagname from Groups,Tags,tagsingroups where tagsingroups.groupid=Groups.id and tagsingroups.tagid=tags.id and Groups.taggroup='EXIF';" verwendet werden.<br>\
Ein Datenbankdiagram steht zur Verf\u00fcgung, f\u00fcr jene (Experten), die dies w\u00fcnschen.


abouttitle = \u00dcber jExifToolGUI for ExifTool by Phil Harvey
abouttext = <big>jExifToolGUI</big><hr><br>\
<strong>jExifToolGui</strong> ist ein Java/Swing Programm, das als \
grafische Benutzeroberfl\u00e4che (GUI) f\u00fcr <a href='https://www.exiftool.org/'>exiftool</a> entwickelt wird.<br><br>\
Exiftool wurde geschrieben und wird entwickelt von Phil Harvey. Vielen Dank f\u00fcr dieses exzellente Werkzeug. Ohne das ExifTool, \
w\u00fcrde diese Programm nicht entwickelt werden.<br><br>\
jExifToolGUI ist (nur) eine grafische Benutzeroberfl\u00e4che daf\u00fcr. \
Es kann Metadaten aus "Referenzbildern" auf andere Bilder \u00fcbertragen, beispielsweise um GPS Daten zu erg\u00e4nzen\
 oder in vielen Bildern zu korrigeren.<br>\
jExifToolGUI erlaubt weitreichende, automatische Umbenennungen von Bildern, basieren auf deren Metadaten.\
<br>jExifToolGUI ist frei Open Source software: es darf weitergeben und \
und ver\u00e4ndert werden, unter Ber\u00fccksichtigung der "Terms of the GNU General Public License \
as published by the Free Software Foundation, either version \
3 of the License, or (at your option) any later version".\
<br>Das Programm wird verteilt in der Hoffnung, n\u00fctzlich zu sein. \
Es gibt KEINE GARANTIE; auch nicht implizit \
auf gar nichts.  Siehe die GNU General Public License f\u00fcr die Details.\
<br>(You should have received a copy of the GNU General Public \
License along with this program. If not, see <a href='http://www.gnu.org/licenses'>www.gnu.org/licenses</a>.)</p>\
<br><br>Autor/Creator des ExifTool: Phil Harvey.\
<br><br>Autor/Creator von jExifToolGUI: Harry van der Wolf.


aboutexiftooltitle = \u00dcber das ExifTool von Phil Harvey
aboutexiftool = <big>ExifTool</big><hr><br>\
Das ExifTool ist ein plattform\u00fcbergreifendes Perl Programm (und eine Library) zum Lesen, Schreiben und Modifizieren von Metadaten f\u00fcr viele Dateitypen.<br> \
Es ist das mit Abstand ausgereifteste und leistungsf\u00e4higste Programm f\u00fcr diese Zweck!<br><br>\
Es bearbeitet Metadaten vieler Dateitypen, Schwerpunkt sind aber Bilder. Es schreibt EXIF, GPS, XMP, Makernotes f\u00fcr \
viele Kameras, JFIF, GeoTIFF, ICC Profile, Photoshop IRB, FlashPix vieles, vieles, mehr.<br>\
Es sit in der Lage Metadaten aus "Referenzbildern" in viele weitere oder ein gesamtes Bilderverzeichnis zu \u00fcbertragen.<br>\
<br><br>Author/creator/maintainer of ExifTool: Phil Harvey.<br><br>


noexiftooltitle = Exitool fehlt
noexiftool = <b>Das Exiftool wurde nicht im PATH oder unter dem in den Einstellungen angegeben Pfad gefunden.<br>\
Ohne das Exiftool kann dieses Programm nicht weiter arbeiten.</b><br><br>\
Diese M\u00f6glichkeiten gibt es jetzt:<br>\
<ul><li>Linux: installiere es mit dem Paketmanager (eventuell eine \u00e4ltere Version) oder lade die aktuelle Version von Phil Harvey's Exiftool Website.</li>\
<li>Windows: Hole die aktuelle Version von Phil Harvey's Exiftool Website.</li>\
<li>Mac OS/X: Installiere es via MacPorts oder Homebrew oder lade die aktuelle Version von Phil Harvey's Exiftool Website.</li></ul>\
W\u00e4hle eine dieser Optionen.

